TOOL:	xrun	19.09-s003: Started on Oct 24, 2021 at 22:47:09 CEST
xrun
	-F tb.f
		-F ./dut.f
			alu/mtm_Alu.vp
		alu_tb.sv
	-v93
	-define DEBUG
	+nowarnDSEM2009
	+nowarnDSEMEL
	+nowarnCGDEFN
	-xmlibdirname INCA_libs_gui
	+access+r
	+gui
	+overwrite
	-nocopyright
	-l xrun_gui.log
	-s
Recompiling... reason: file './alu_tb.sv' is newer than expected.
	expected: Sun Oct 24 22:43:35 2021
	actual:   Sun Oct 24 22:46:55 2021
file: ./alu_tb.sv
	module worklib.top:sv
		errors: 0, warnings: 0
		Caching library 'worklib' ....... Done
	Elaborating the design hierarchy:
	Top level design units:
		top
	Building instance overlay tables: .................... Done
	Generating native compiled code:
		worklib.top:sv <0x1dd5ac98>
			streams:  11, words: 14133
	Building instance specific data structures.
	Loading native compiled code:     .................... Done
	Design hierarchy summary:
		                 Instances  Unique
		Modules:                 5       5
		Registers:              88      88
		Scalar wires:            7       -
		Vectored wires:          2       -
		Always blocks:          12      12
		Initial blocks:          3       3
		Pseudo assignments:      1       1
		Simulation timescale:  1ps
	Writing initial simulation snapshot: worklib.top:sv
xmsim: *W,XCLGNOPTM: The SystemVerilog constraint solver Xceligen options 'seed_only_rand and process_alternate_rng and ignore_worklib_name' are not specified and will default to 0. The recommended value for each of them is 1 which will become the default in a future release.
SVSEED default: 1
xmsim: *W,RNDXCELON: Xceligen, the new SystemVerilog constraint solver is used. Disabling Xceligen and using the legacy constraint solver is possible with "xrun/xmsim -xceligen on=0 ...".
xcelium> 
xcelium> source /cad/XCELIUM1909/tools/xcelium/files/xmsimrc
xcelium> 
-------------------------------------
Relinquished control to SimVision...
# Restoring simulation environment...
xcelium> input -quiet .reinvoke.sim
xcelium> file delete .reinvoke.sim
xcelium> run
Simulation complete via $finish(1) at time 331330 NS + 0
./alu_tb.sv:123 		$finish;
xcelium> probe -create -shm top.op_set
Created probe 7
xcelium> reset
SVSEED default: 1
xmsim: *W,RNDXCELON: Xceligen, the new SystemVerilog constraint solver is used. Disabling Xceligen and using the legacy constraint solver is possible with "xrun/xmsim -xceligen on=0 ...".
Loaded snapshot worklib.top:sv
xcelium> run
Simulation complete via $finish(1) at time 331330 NS + 0
./alu_tb.sv:123 		$finish;
xcelium> ...Regained control from SimVision
-------------------------------------

xcelium> 
xmsim: *W,CMUSEX: Control-D in interactive input - one more to exit.
xcelium> exit
TOOL:	xrun	19.09-s003: Exiting on Oct 25, 2021 at 22:30:37 CEST  (total: 23:43:28)
